-------------------------------------
vim 基础
-------------------------------------

h、j、k、l
左、下、上、右
(1) :e filename < - > 打开文件filename，注意filename包含文件路径
:e ~/hahaya.cc 打开主目录下的hahaya.cc文件
(2) saveas filename < - > 文件另存为，注意filename包含文件路径
(3) :w < - > 文件保存
(4) :q < - >  不保存退出，回到终端下
(5) :q! < - > 不保存强制退出
(6) :wq < - > 保存退出
(7) :wq!   < - > 强制保存退出
(8) :bn < - > 打开多个文件时，使用该命令切换到下一个文件
(9) :bp < - > 打开多个文件时，使用该命令切换到上一个文件

-------------------------------------
vim 调教教程
-------------------------------------
.vimrc 文件：
vim 行为的配置文件
用于将 vim 调教成最适合你的编辑器。
-------------------------------------
